
## Plan Result

[CI link](https://github.com/hayas1/tfgh/actions/runs/13010938419)


<pre><code>Plan: 14 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * module.repositories[&#34;go-fluffy-json&#34;].github_issue_label.this[&#34;breaking&#34;]
  * module.repositories[&#34;go-fluffy-json&#34;].github_issue_label.this[&#34;bugfix&#34;]
  * module.repositories[&#34;go-fluffy-json&#34;].github_issue_label.this[&#34;deps&#34;]
  * module.repositories[&#34;go-fluffy-json&#34;].github_issue_label.this[&#34;documentation&#34;]
  * module.repositories[&#34;go-fluffy-json&#34;].github_issue_label.this[&#34;feature&#34;]
  * module.repositories[&#34;go-fluffy-json&#34;].github_issue_label.this[&#34;maintenance&#34;]
  * module.repositories[&#34;go-fluffy-json&#34;].github_issue_label.this[&#34;refactor&#34;]
  * module.repositories[&#34;go-fluffy-json&#34;].github_repository_file.this[&#34;github/issue_template.md&#34;]
  * module.repositories[&#34;go-fluffy-json&#34;].github_repository_file.this[&#34;github/labeler.yml&#34;]
  * module.repositories[&#34;go-fluffy-json&#34;].github_repository_file.this[&#34;github/pull_request_template.md&#34;]
  * module.repositories[&#34;go-fluffy-json&#34;].github_repository_file.this[&#34;github/release.yml&#34;]
  * module.repositories[&#34;go-fluffy-json&#34;].github_repository_file.this[&#34;github/workflows/labeler.yml&#34;]
  * module.repositories[&#34;go-fluffy-json&#34;].github_repository_pull_request.managed
  * module.repositories[&#34;go-fluffy-json&#34;].github_repository_ruleset.this
* Update
  * module.repositories[&#34;go-fluffy-json&#34;].github_repository.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.repositories["go-fluffy-json"].github_issue_label.this["breaking"] will be created
  + resource "github_issue_label" "this" {
      + color       = "F84AD4"
      + description = "Containing breaking changes"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "breaking"
      + repository  = "go-fluffy-json"
      + url         = (known after apply)
    }

  # module.repositories["go-fluffy-json"].github_issue_label.this["bugfix"] will be created
  + resource "github_issue_label" "this" {
      + color       = "DE3659"
      + description = "Fix some bugs"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "bugfix"
      + repository  = "go-fluffy-json"
      + url         = (known after apply)
    }

  # module.repositories["go-fluffy-json"].github_issue_label.this["deps"] will be created
  + resource "github_issue_label" "this" {
      + color       = "36BF46"
      + description = "Dependency updates"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "deps"
      + repository  = "go-fluffy-json"
      + url         = (known after apply)
    }

  # module.repositories["go-fluffy-json"].github_issue_label.this["documentation"] will be created
  + resource "github_issue_label" "this" {
      + color       = "0075CA"
      + description = "Documentation"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "documentation"
      + repository  = "go-fluffy-json"
      + url         = (known after apply)
    }

  # module.repositories["go-fluffy-json"].github_issue_label.this["feature"] will be created
  + resource "github_issue_label" "this" {
      + color       = "008B75"
      + description = "New feature"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "feature"
      + repository  = "go-fluffy-json"
      + url         = (known after apply)
    }

  # module.repositories["go-fluffy-json"].github_issue_label.this["maintenance"] will be created
  + resource "github_issue_label" "this" {
      + color       = "7F6054"
      + description = "No effect on codebase"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "maintenance"
      + repository  = "go-fluffy-json"
      + url         = (known after apply)
    }

  # module.repositories["go-fluffy-json"].github_issue_label.this["refactor"] will be created
  + resource "github_issue_label" "this" {
      + color       = "BA5798"
      + description = "Refactoring"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "refactor"
      + repository  = "go-fluffy-json"
      + url         = (known after apply)
    }

  # module.repositories["go-fluffy-json"].github_repository.this will be updated in-place
  ~ resource "github_repository" "this" {
      ~ auto_init                   = false -> true
      ~ delete_branch_on_merge      = false -> true
      - has_downloads               = true -> null
      - has_projects                = true -> null
      - has_wiki                    = true -> null
        id                          = "go-fluffy-json"
        name                        = "go-fluffy-json"
        # (31 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repositories["go-fluffy-json"].github_repository_file.this["github/issue_template.md"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "main"
      + autocreate_branch_source_sha    = (known after apply)
      + branch                          = "chore/managed-by-terraform"
      + commit_message                  = "Managed by Terraform: .github/issue_template.md"
      + commit_sha                      = (known after apply)
      + content                         = <<-EOT
            <!-- This template is managed by terraform. https://github.com/hayas1/tfgh -->
            
            ## Expectation :butterfly:
            > [Delete me] What behavior is expected?
            
            ## Reality :bug:
            > [Delete me] How does it actually work?
            
            ## Environment :evergreen_tree:
            > [Delete me] (When and) Where the behavior was observed?
            
            ## Cause :mag:
            > [Delete me] Why this issue was occurred?
            
            ## Related :chains:
            > [Delete me] The list of related issues or pull requests
            
            ## Remark :eyes:
            > [Delete me] Any remarks
        EOT
      + file                            = ".github/issue_template.md"
      + id                              = (known after apply)
      + overwrite_on_create             = true
      + ref                             = (known after apply)
      + repository                      = "go-fluffy-json"
      + sha                             = (known after apply)
    }

  # module.repositories["go-fluffy-json"].github_repository_file.this["github/labeler.yml"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "main"
      + autocreate_branch_source_sha    = (known after apply)
      + branch                          = "chore/managed-by-terraform"
      + commit_message                  = "Managed by Terraform: .github/labeler.yml"
      + commit_sha                      = (known after apply)
      + content                         = <<-EOT
            # Managed by terraform. https://github.com/hayas1/tfgh
            
            feature:
              - head-branch:
                - '^feat/'
                - '^feature/'
            
            breaking:
              - head-branch:
                - '^breaking/'
            
            bugfix:
              - head-branch:
                - '^fix/'
                - '^bugfix/'
                - '^modify/'
            
            refactor:
              - head-branch:
                - '^refactor/'
            
            documentation:
              - changed-files:
                - any-glob-to-any-file:
                  - '**/README.md'
              - head-branch:
                - '^doc/'
                - '^docs/'
                - '^documentation/'
            
            deps:
              - head-branch:
                - '^dep/'
                - '^deps/'
                - '^dependencies/'
            
            maintenance:
              - changed-files:
                - any-glob-to-any-file:
                  - '.github/**'
              - head-branch:
                - '^maintenance/'
                - '^ci/'
                - '^workflow/'
                - '^chore/'
        EOT
      + file                            = ".github/labeler.yml"
      + id                              = (known after apply)
      + overwrite_on_create             = true
      + ref                             = (known after apply)
      + repository                      = "go-fluffy-json"
      + sha                             = (known after apply)
    }

  # module.repositories["go-fluffy-json"].github_repository_file.this["github/pull_request_template.md"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "main"
      + autocreate_branch_source_sha    = (known after apply)
      + branch                          = "chore/managed-by-terraform"
      + commit_message                  = "Managed by Terraform: .github/pull_request_template.md"
      + commit_sha                      = (known after apply)
      + content                         = <<-EOT
            <!-- This template is managed by terraform. https://github.com/hayas1/tfgh -->
            
            ## Overview :rocket:
            > [Delete me] What is this pull request?
            
            ## Implementation :clamp:
            > [Delete me] How to realize ?
            
            ## Use cases :chopsticks:
            > [Delete me] Why this pull request was created?
            
            ## Testing :gear:
            > [Delete me] Testing steps
            
            ## Related :chains:
            > [Delete me] The list of related issues or pull requests
            
            ## Remark :eyes:
            > [Delete me] Any remarks
        EOT
      + file                            = ".github/pull_request_template.md"
      + id                              = (known after apply)
      + overwrite_on_create             = true
      + ref                             = (known after apply)
      + repository                      = "go-fluffy-json"
      + sha                             = (known after apply)
    }

  # module.repositories["go-fluffy-json"].github_repository_file.this["github/release.yml"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "main"
      + autocreate_branch_source_sha    = (known after apply)
      + branch                          = "chore/managed-by-terraform"
      + commit_message                  = "Managed by Terraform: .github/release.yml"
      + commit_sha                      = (known after apply)
      + content                         = <<-EOT
            # Managed by terraform. https://github.com/hayas1/tfgh
            
            changelog:
              categories:
                - title: '🚀 Features'
                  labels:
                    - feature
                - title: '🔨 Breaking Changes'
                  labels:
                    - breaking
                - title: '🐛 Bug Fixes'
                  labels:
                    - bugfix
                - title: '🔧 Refactoring'
                  labels:
                    - refactor
                - title: '📖 Documentation'
                  labels:
                    - documentation
                - title: '👒 Dependency update'
                  labels:
                    - deps
                - title: '🧰 Maintenance'
                  labels:
                    - maintenance
                - title: Other Changes
                  labels:
                    - "*"
        EOT
      + file                            = ".github/release.yml"
      + id                              = (known after apply)
      + overwrite_on_create             = true
      + ref                             = (known after apply)
      + repository                      = "go-fluffy-json"
      + sha                             = (known after apply)
    }

  # module.repositories["go-fluffy-json"].github_repository_file.this["github/workflows/labeler.yml"] will be created
  + resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "main"
      + autocreate_branch_source_sha    = (known after apply)
      + branch                          = "chore/managed-by-terraform"
      + commit_message                  = "Managed by Terraform: .github/workflows/labeler.yml"
      + commit_sha                      = (known after apply)
      + content                         = <<-EOT
            # Managed by terraform. https://github.com/hayas1/tfgh
            
            name: Pull Request Labeler
            on:
            - pull_request_target
            
            jobs:
              labeler:
                permissions:
                  contents: read
                  pull-requests: write
                runs-on: ubuntu-latest
                steps:
                - uses: actions/labeler@v5
        EOT
      + file                            = ".github/workflows/labeler.yml"
      + id                              = (known after apply)
      + overwrite_on_create             = true
      + ref                             = (known after apply)
      + repository                      = "go-fluffy-json"
      + sha                             = (known after apply)
    }

  # module.repositories["go-fluffy-json"].github_repository_pull_request.managed will be created
  + resource "github_repository_pull_request" "managed" {
      + base_ref              = "main"
      + base_repository       = "go-fluffy-json"
      + base_sha              = (known after apply)
      + body                  = <<-EOT
            - .github/issue_template.md
            - .github/labeler.yml
            - .github/pull_request_template.md
            - .github/release.yml
            - .github/workflows/labeler.yml
        EOT
      + draft                 = (known after apply)
      + head_ref              = "chore/managed-by-terraform"
      + head_sha              = (known after apply)
      + id                    = (known after apply)
      + labels                = (known after apply)
      + maintainer_can_modify = false
      + number                = (known after apply)
      + opened_at             = (known after apply)
      + opened_by             = (known after apply)
      + state                 = (known after apply)
      + title                 = "[auto] snippet files managed by Terraform"
      + updated_at            = (known after apply)
    }

  # module.repositories["go-fluffy-json"].github_repository_ruleset.this will be created
  + resource "github_repository_ruleset" "this" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "default"
      + node_id     = (known after apply)
      + repository  = "go-fluffy-json"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + bypass_actors {
          + actor_id    = 5
          + actor_type  = "RepositoryRole"
          + bypass_mode = "pull_request"
        }

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "~DEFAULT_BRANCH",
                ]
            }
        }

      + rules {
          + creation                      = true
          + deletion                      = true
          + non_fast_forward              = true
          + update_allows_fetch_and_merge = false

          + pull_request {
              + dismiss_stale_reviews_on_push     = false
              + require_code_owner_review         = false
              + require_last_push_approval        = false
              + required_approving_review_count   = 0
              + required_review_thread_resolution = false
            }
        }
    }

Plan: 14 to add, 1 to change, 0 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.repositories["devcontainer-features"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"9a7a65f8cd8b7e57a46590c8f80f06d6cf78e86cc20a7ae4d4db31a2c494c939\"" -> "W/\"817e67fc3d3f3e9d2dc6da602498e99371ba4b8ffa511f57dd7edbc6bfd5eb6e\""
        id                          = "devcontainer-features"
        name                        = "devcontainer-features"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repositories["dyson-rs"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"9f20dca849d24bc8404856e85415af4bc1f6e64f14ac8c2273d2ede4b9787d29\"" -> "W/\"134477358a2135525668aaabe559f5ee307b9f7fc3cfb5a6e2d36a9aca66273a\""
        id                          = "dyson-rs"
        name                        = "dyson-rs"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repositories["go-fluffy-json"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"20c89156c2163dabd245d84465a13e44f751dfd03fd26276ad450d86a6b1ce53\"" -> "W/\"b377708833698aa909888d9f5e4a7b296a6b28475e032caa84d8c1f0910194b4\""
        id                          = "go-fluffy-json"
        name                        = "go-fluffy-json"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repositories["json-with-comments"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"5771e20347ad85054305bdbf7743c6884a8b700e8c98d142dcfc3c81ef973466\"" -> "W/\"f344536ab6ba76fefabd6b687082782ccca442c8c100169ff7ad61483c171909\""
        id                          = "json-with-comments"
        name                        = "json-with-comments"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repositories["relentless"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ description                 = "Relentless HTTP load testing / comparison testing tool" -> "Relentless load testing and comparison testing tool for HTTP / GRPC"
      ~ etag                        = "W/\"59ecb16387c7fc0bfb090a71cd1799077124c86c3a3378c6f49f162e4207e472\"" -> "W/\"279176da9d480013436d6d36d03d3d8d85a7d941c21c535d3ed7933be15b10e2\""
        id                          = "relentless"
        name                        = "relentless"
        # (34 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repositories["tfgh"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"2ab54d3b766d74fdd334f023d2c24874a23547d91d862fae21801731f0c344ef\"" -> "W/\"56bca1628c203669fd79b413b0a384af9d1c44b83444547c7ebaa5af29572507\""
        id                          = "tfgh"
        name                        = "tfgh"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repositories["tokei-toukei"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"975a6b112b25217473e9b4e2e55d0c4f1a5b48e7645b5575d64aec6a7eb2e32d\"" -> "W/\"8630856cfabc48be6e91f98506d153c6f11bbc5e44d76d54b38a211b758bf0ad\""
        id                          = "tokei-toukei"
        name                        = "tokei-toukei"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":82,"Program":"tfcmt","SHA1":"0e0a94efc7a2d960c4ba334aa7d88814168532f2","Vars":{},"WorkflowName":"Terraform plan on pull request"} -->